In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '@'],
    'Age': [29, 30, 24, 140, 25],
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  140
4   @   25

The above DataFrame doesn't have any "missing value", but clearly has invalid data. 140 doesn't seem like a valid age, and D and @ don't correspond with any known sex category. How can you clean these not-missing, but clearly invalid values then?

# Finding Unique Values

The first step to clean invalid values is to notice them, then identify them and finally handle them appropriately (remove them, replace them, etc). Usually, for a "categorical" type of field (like Sex, which only takes values of a discrete set ('M', 'F')), we start by analyzing the variety of values present. For that, we use the unique() method:

In [3]:
df['Sex'].unique()

array(['M', 'F', 'D', '@'], dtype=object)

In [4]:
df['Sex'].value_counts()

F    2
M    1
D    1
@    1
Name: Sex, dtype: int64

Clearly if you see values like 'D' or '@', it'll immediately raise your attention. Now, what to do with them? Let's say you picked up the phone, called the survey company and they told you that 'D' was a typo and it should actually be F. You can use the replace function to replace these values:

In [5]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    @
Name: Sex, dtype: object

It can accept a dictionary of values to replace. For example, they also told you that there might be a few 'N's, that should actually be 'M's:

In [6]:
df['Sex'].replace({'D': 'F', 'N': 'M'})

0    M
1    F
2    F
3    F
4    @
Name: Sex, dtype: object

It can accept a dictionary of values to replace. For example, they also told you that there might be a few '@'s, that should actually be 'M's:

In [7]:
df['Sex'].replace({'D': 'F', '@': 'M'})

0    M
1    F
2    F
3    F
4    M
Name: Sex, dtype: object

If you have many columns to replace, you could apply it at "DataFrame level":

In [9]:
df.replace({
    'Sex': {
        'D': 'F',
        'N': 'M',
        '@': 'M'
    },
    'Age': {
        140: 14
    }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   14
4   M   25

In the previous example, I explicitly replaced 140 with 14 (assuming it was just an extra 0 entered at data-entry phase). But what if you'd like to remove all the extra 0s from the ages columns? (example, 290 > 29, 490 > 49).

The first step would be to just set the limit of the "not possible" age. Is it 100? 120? Let's say that anything above 100 isn't credible for our dataset. We can then combine boolean selection with the operation:

In [10]:
df[df['Age'] > 100]

  Sex  Age
3   D  140

And we can now just divide by 10:

In [11]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [12]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   14
4   @   25